; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
	Star20 - direction
	Star21 - direction
	Phenomenon22 - direction
	Star23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star21)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star23)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon22)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite2 GroundStation1)
	(have_image Star3 thermograph2)
	(have_image Star4 thermograph2)
	(have_image Phenomenon5 thermograph2)
	(have_image Phenomenon6 thermograph2)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 thermograph2)
	(have_image Phenomenon14 thermograph2)
	(have_image Planet15 thermograph2)
	(have_image Planet16 infrared1)
	(have_image Star17 infrared1)
	(have_image Planet19 thermograph0)
	(have_image Star20 thermograph2)
	(have_image Star21 thermograph2)
	(have_image Phenomenon22 thermograph2)
	(have_image Star23 thermograph0)
	(have_image Phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 22
2. (turn_to satellite4 star2 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star2)
   goals met: 0 of 22
3. (calibrate satellite4 instrument8 star2)
   added: (calibrated instrument8)
   goals met: 0 of 22
4. (turn_to satellite4 phenomenon10 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 22
5. (take_image satellite4 phenomenon10 instrument8 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 1 of 22
6. (turn_to satellite4 phenomenon11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon11)
   goals met: 1 of 22
7. (take_image satellite4 phenomenon11 instrument8 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 2 of 22
8. (turn_to satellite4 phenomenon12 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon12)
   goals met: 2 of 22
9. (take_image satellite4 phenomenon12 instrument8 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 3 of 22
10. (turn_to satellite4 phenomenon14 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon14)
   goals met: 3 of 22
11. (take_image satellite4 phenomenon14 instrument8 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 4 of 22
12. (turn_to satellite4 phenomenon22 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon22)
   goals met: 4 of 22
13. (take_image satellite4 phenomenon22 instrument8 thermograph2)
   added: (have_image phenomenon22 thermograph2)
   goals met: 5 of 22
14. (turn_to satellite4 phenomenon24 phenomenon22)
   deleted: (pointing satellite4 phenomenon22)
   added: (pointing satellite4 phenomenon24)
   goals met: 5 of 22
15. (take_image satellite4 phenomenon24 instrument8 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 6 of 22
16. (turn_to satellite4 phenomenon5 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 phenomenon5)
   goals met: 6 of 22
17. (take_image satellite4 phenomenon5 instrument8 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 7 of 22
18. (turn_to satellite4 phenomenon6 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon6)
   goals met: 7 of 22
19. (take_image satellite4 phenomenon6 instrument8 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 8 of 22
20. (turn_to satellite4 phenomenon9 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon9)
   goals met: 8 of 22
21. (take_image satellite4 phenomenon9 instrument8 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 9 of 22
22. (turn_to satellite4 planet13 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet13)
   goals met: 9 of 22
23. (take_image satellite4 planet13 instrument8 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 10 of 22
24. (turn_to satellite4 planet15 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet15)
   goals met: 10 of 22
25. (take_image satellite4 planet15 instrument8 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 11 of 22
26. (turn_to satellite4 planet16 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet16)
   goals met: 11 of 22
27. (take_image satellite4 planet16 instrument8 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 12 of 22
28. (turn_to satellite4 planet19 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet19)
   goals met: 12 of 22
29. (take_image satellite4 planet19 instrument8 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 13 of 22
30. (turn_to satellite4 star17 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star17)
   goals met: 13 of 22
31. (take_image satellite4 star17 instrument8 infrared1)
   added: (have_image star17 infrared1)
   goals met: 14 of 22
32. (turn_to satellite4 star20 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star20)
   goals met: 14 of 22
33. (take_image satellite4 star20 instrument8 thermograph2)
   added: (have_image star20 thermograph2)
   goals met: 15 of 22
34. (turn_to satellite4 star21 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star21)
   goals met: 15 of 22
35. (take_image satellite4 star21 instrument8 thermograph2)
   added: (have_image star21 thermograph2)
   goals met: 16 of 22
36. (turn_to satellite4 star23 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star23)
   goals met: 16 of 22
37. (take_image satellite4 star23 instrument8 thermograph0)
   added: (have_image star23 thermograph0)
   goals met: 17 of 22
38. (turn_to satellite4 star3 star23)
   deleted: (pointing satellite4 star23)
   added: (pointing satellite4 star3)
   goals met: 17 of 22
39. (take_image satellite4 star3 instrument8 thermograph2)
   added: (have_image star3 thermograph2)
   goals met: 18 of 22
40. (turn_to satellite4 star4 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star4)
   goals met: 18 of 22
41. (take_image satellite4 star4 instrument8 thermograph2)
   added: (have_image star4 thermograph2)
   goals met: 19 of 22
42. (turn_to satellite4 star8 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star8)
   goals met: 19 of 22
43. (take_image satellite4 star8 instrument8 infrared1)
   added: (have_image star8 infrared1)
   goals met: 20 of 22
44. (turn_to satellite2 groundstation1 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 groundstation1)
   goals met: 21 of 22
45. (turn_to satellite0 star2 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star2)
   goals met: 22 of 22
